app/controllers/articles_controller.rb

  def update
    @article = Article.find(params[:id])
    @article.update(title: params[:article][:title], description: params[:description])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", nil], ["updated_at", "2019-12-14 19:12:49.408697"], ["id", 1]]